# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]

  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS


# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2   (320x320 if input 640x640)
  - [-1, 1, C2f, [64, True]]     # 1
  
  - [-1, 1, Conv, [128, 3, 2]]   # 2-P2/4   (160x160)
  - [-1, 3, C2f, [128, True]]    # 3
  
  - [-1, 1, Conv, [256, 3, 2]]   # 4-P3/8   (80x80)
  - [-1, 6, C2f, [256, True]]    # 5
  
  - [-1, 1, Conv, [512, 3, 2]]   # 6-P4/16  (40x40)
  - [-1, 6, C2f, [512, True]]    # 7
  
  - [-1, 1, SPPF, [512, 5]]      # 8

# YOLOv8 head with P1, P2, P3, P4 detection
head:
  # Top-down pathway (P4 -> P3 -> P2 -> P1)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9: upsample from P4
  - [[-1, 7], 1, Concat, [1]]                   # 10: cat with backbone P4
  - [-1, 3, C2f, [512]]                         # 11: fuse P4 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12: upsample to P3
  - [[-1, 5], 1, Concat, [1]]                   # 13: cat with backbone P3
  - [-1, 3, C2f, [256]]                         # 14: fuse P3 features (detection ready)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15: upsample to P2
  - [[-1, 3], 1, Concat, [1]]                   # 16: cat with backbone P2
  - [-1, 3, C2f, [128]]                         # 17: fuse P2 features (detection ready)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18: upsample to P1
  - [[-1, 1], 1, Concat, [1]]                   # 19: cat with backbone P1
  - [-1, 3, C2f, [64]]                          # 20: fuse P1 features (detection ready)

  # Bottom-up pathway (P1 -> P2 -> P3 -> P4)
  - [-1, 1, Conv, [128, 3, 2]]                  # 21: downsample from P1
  - [[-1, 17], 1, Concat, [1]]                  # 22: cat with P2 from top-down
  - [-1, 3, C2f, [128]]                         # 23: refined P2 (detection ready)

  - [-1, 1, Conv, [256, 3, 2]]                  # 24: downsample from P2
  - [[-1, 14], 1, Concat, [1]]                  # 25: cat with P3 from top-down
  - [-1, 3, C2f, [256]]                         # 26: refined P3 (detection ready)

  - [-1, 1, Conv, [512, 3, 2]]                  # 27: downsample from P3
  - [[-1, 11], 1, Concat, [1]]                  # 28: cat with P4 from top-down
  - [-1, 3, C2f, [512]]                         # 29: refined P4 (detection ready)

  # Detection heads at multiple scales
  - [[20, 23, 26, 29], 1, Detect, [nc]]         # 30: Detect(P1, P2, P3, P4)

