# YOLO-Tryppa for Malaria Detection (PROPERLY BALANCED)
nc: 5
scales:
  m: [0.67, 0.75, 512]

# Backbone
backbone:
  # Standard Conv (first 2 layers - critical)
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4 ← Save for P2 head
  
  # Increase P2 depth
  - [-1, 3, C2fGhost, [128, True]]         # 2-P2 features (was 1)
  
  # Ghost downsampling
  - [-1, 1, GhostConv, [256, 3, 2]]        # 3-P3/8
  - [-1, 3, C2fGhost, [256, True]]         # 4-P3 features
  
  - [-1, 1, GhostConv, [512, 3, 2]]        # 5-P4/16
  - [-1, 3, C2fGhost, [512, True]]         # 6-P4 features
  
  - [-1, 1, SPPF, [512, 5]]                # 7

# Head
head:
  # Top-down
  - [-1, 1, GhostConv, [256, 1, 1]]                  # 8
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 9
  - [[-1, 4], 1, Concat, [1]]                        # 10
  - [-1, 3, C2fGhost, [256, False]]                  # 11
  
  - [-1, 1, GhostConv, [128, 1, 1]]                  # 12
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 13
  - [[-1, 1], 1, Concat, [1]]                        # 14 - FIXED: layer 1 not 2
  - [-1, 3, C2fGhost, [128, False]]                  # 15
  
  # Bottom-up
  - [-1, 1, GhostConv, [128, 3, 2]]                  # 16
  - [[-1, 11], 1, Concat, [1]]                       # 17
  - [-1, 3, C2fGhost, [256, False]]                  # 18
  
  - [-1, 1, GhostConv, [256, 3, 2]]                  # 19
  - [[-1, 7], 1, Concat, [1]]                        # 20
  - [-1, 3, C2fGhost, [512, False]]                  # 21
  
  # Detection
  - [[15, 18, 21], 1, Detect, [nc]]                  # 22