# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Parameters
nc: 5 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768] # YOLOv8m

# YOLOv8 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2   (320x320)
  - [-1, 1, C2f, [64, True]]     # 1
  
  - [-1, 1, Conv, [128, 3, 2]]   # 2-P2/4   (160x160)
  - [-1, 3, C2f, [128, True]]    # 3
  
  - [-1, 1, Conv, [256, 3, 2]]   # 4-P3/8   (80x80)
  - [-1, 6, C2f, [256, True]]    # 5
  
  - [-1, 1, Conv, [512, 3, 2]]   # 6-P4/16  (40x40)
  - [-1, 6, C2f, [512, True]]    # 7
  
  - [-1, 1, SPPF, [512, 5]]      # 8

# YOLOv8 head with P1, P2, P3, P4 detection
head:
  # Top-down pathway (P4 -> P3 -> P2 -> P1)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9: 40→80 (upsample from P4)
  - [[-1, 5], 1, Concat, [1]]                   # 10: concat with P3 (both 80×80) 
  - [-1, 3, C2f, [256]]                         # 11: fuse P3 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12: 80→160 (upsample to P2)
  - [[-1, 3], 1, Concat, [1]]                   # 13: concat with P2 (both 160×160) 
  - [-1, 3, C2f, [128]]                         # 14: fuse P2 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15: 160→320 (upsample to P1)
  - [[-1, 1], 1, Concat, [1]]                   # 16: concat with P1 (both 320×320) 
  - [-1, 3, C2f, [64]]                          # 17: fuse P1 features


  # Bottom-up pathway (P1 -> P2 -> P3 -> P4)
  - [-1, 1, Conv, [128, 3, 2]]                  # 18: 320→160 (downsample from P1)
  - [[-1, 14], 1, Concat, [1]]                  # 19: concat with P2 (both 160×160) 
  - [-1, 3, C2f, [128]]                         # 20: refined P2

  - [-1, 1, Conv, [256, 3, 2]]                  # 21: 160→80 (downsample from P2)
  - [[-1, 11], 1, Concat, [1]]                  # 22: concat with P3 (both 80×80) 
  - [-1, 3, C2f, [256]]                         # 23: refined P3

  - [-1, 1, Conv, [512, 3, 2]]                  # 24: 80→40 (downsample from P3)
  - [[-1, 8], 1, Concat, [1]]                   # 25: concat with P4 (both 40×40) 
  - [-1, 3, C2f, [512]]                         # 26: refined P4

  # Detection heads at multiple scales
  - [[17, 20, 23, 26], 1, Detect, [nc]]         # 27: Detect(P1, P2, P3, P4)