# Ultralytics YOLOv8 🚀, AGPL-3.0 license
# YOLOv8m-Attention: Enhanced attention for small objects
# YOLOv8m with C2fPSA and C2fAttn modules
# Expected: ~8-12 FPS on Pi 5 @ 640x640

# Parameters
nc: 5  # number of classes
scales:
  m: [0.67, 0.75, 768]  # Medium size

# Attention-enhanced backbone
backbone:
  # [from, repeats, module, args]
  
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  
  # P2 with PSA attention (critical for small objects)
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, C2fPSA, [128, True]]        # 2 - Position-Sensitive Attention
  
  # P3 with standard C2f
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 6, C2f, [256, True]]           # 4
  
  # P4 with attention
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 6, C2fAttn, [512, True]]       # 6 - Attention module
  
  # P5 with pooling
  - [-1, 1, Conv, [512, 3, 2]]          # 7-P5/32
  - [-1, 3, C2f, [512, True]]           # 8
  - [-1, 1, SPPF, [512, 5]]             # 9

# Enhanced head with attention
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2fAttn, [512, False]]               # 12 - Attention fusion
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 3, C2f, [256, False]]                   # 15
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 2], 1, Concat, [1]]                    # 17
  - [-1, 3, C2fPSA, [128, False]]                # 18 - PSA for P2
  
  - [-1, 1, Conv, [256, 3, 2]]                   # 19
  - [[-1, 15], 1, Concat, [1]]                   # 20
  - [-1, 3, C2f, [256, False]]                   # 21
  
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 12], 1, Concat, [1]]                   # 23
  - [-1, 3, C2f, [512, False]]                   # 24
  
  - [-1, 1, Conv, [512, 3, 2]]                   # 25
  - [[-1, 9], 1, Concat, [1]]                    # 26
  - [-1, 3, C2f, [512, False]]                   # 27
  
  # 4-scale detection with attention-enhanced P2
  - [[18, 21, 24], 1, Detect, [nc]]          # 28 - Detect(P2, P3, P4, P5)