# Ultralytics 🚀 AGPL-3.0 License
# YOLOv8m-CBAM-NAM (P2–P4) for small-object detection

# Parameters
nc: 5  # number of classes

scales:
  m: [0.67, 0.75, 768]  # YOLOv8m scaling

# -------------------------------------------------
# Backbone
# -------------------------------------------------
backbone:
  # [from, repeats, module, args]

  # P1
  - [-1, 1, Conv, [64, 3, 2]]          # 0: P1/2
  - [-1, 1, C2f, [64, True]]           # 1

  # P2
  - [-1, 1, Conv, [128, 3, 2]]         # 2: P2/4
  - [-1, 3, C2f, [128, True]]          # 3

  # P3
  - [-1, 1, Conv, [256, 3, 2]]         # 4: P3/8
  - [-1, 6, C2f, [256, True]]          # 5
  - [-1, 1, CBAM, []]                  # 6: CBAM at P3 (dynamic channels)

  # P4
  - [-1, 1, Conv, [512, 3, 2]]         # 7: P4/16
  - [-1, 6, C2f, [512, True]]          # 8
  - [-1, 1, CBAM, []]                  # 9: CBAM at P4

  # SPPF
  - [-1, 1, SPPF, [512, 5]]             # 10

# -------------------------------------------------
# Neck / Head (PAN-FPN)
# -------------------------------------------------
head:
  # Top-down pathway
  - [-1, 1, Conv, [256, 1, 1]]          # 11
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 6], 1, Concat, [1]]           # 13: P4 + P3
  - [-1, 3, C2f, [256]]                 # 14

  - [-1, 1, Conv, [128, 1, 1]]          # 15
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 3], 1, Concat, [1]]           # 17: P3 + P2
  - [-1, 3, C2f, [128]]                 # 18

  # Bottom-up pathway
  - [-1, 1, Conv, [128, 3, 2]]          # 19
  - [[-1, 14], 1, Concat, [1]]           # 20
  - [-1, 3, C2f, [256]]                 # 21

  - [-1, 1, Conv, [256, 3, 2]]          # 22
  - [[-1, 10], 1, Concat, [1]]           # 23
  - [-1, 3, C2f, [512]]                 # 24

  # -------------------------------------------------
  # NAM Attention before detection heads
  # -------------------------------------------------
  - [18, 1, NAM_Attention, []]           # 25: P2
  - [21, 1, NAM_Attention, []]           # 26: P3
  - [24, 1, NAM_Attention, []]           # 27: P4

  # -------------------------------------------------
  # Detection Head (P2, P3, P4)
  # -------------------------------------------------
  - [[25, 26, 27], 1, Detect, [nc]]      # 28
